Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ГрафикРаботыМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ГрафикРаботыМенеджеров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Менеджера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/БП_ГрафикРаботыМенеджеровMagento.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>БП_ГрафикРаботыМенеджеровMagento</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Менеджера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ГрафикРаботыМенеджеров_Хорошоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ГрафикРаботыМенеджеров_Хорошоп</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Менеджера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ОтчетКомиссионераОПродажах</xr:Item>
				<xr:Item>Document.ОтчетКомитентуОПродажах</xr:Item>
				<xr:Item>Document.ПереоценкаТоваровОтданныхНаКомиссию</xr:Item>
				<xr:Item>Document.ПереоценкаТоваровПринятыхНаКомиссию</xr:Item>
				<xr:Item>Document.РезервированиеТоваров</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеВходящее</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеИсходящее</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.СчетНаОплатуПокупателю</xr:Item>
				<xr:Item>Document.ВозвратТоваровПоставщикуИзНТТ</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслугВНТТ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсточникИнформацииПриОбращении</xr:Item>
				<xr:Item>InformationRegister.ПланируемаяЗанятостьПомещений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Э_Лиды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииПриОбращении</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНапомнитьОСобытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровПринятыхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровОтданныхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВходящееИсходящееСобытие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Территории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоБезКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИнтервалНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметКонтакта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Трудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_CallIDЗвонкаBinotel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ПропущенныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ТелефонАбонента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_SMSСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_НашНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СторонниеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Пользователи/Ext/ManagerModule.bsl
Функция ПолучитьМенеджераУКоторогоНаименьшнееКолВоПредЗаказовВСтатусеПропущенный() Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафика
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров КАК ГрафикРаботыМенеджеров
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(БП_ГрафикРаботыМенеджеровMagento.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТБП_ГрафикРаботыМенеджеровMagento
	               |ИЗ
	               |	Документ.БП_ГрафикРаботыМенеджеровMagento КАК БП_ГрафикРаботыМенеджеровMagento
	               |ГДЕ
	               |	НЕ БП_ГрафикРаботыМенеджеровMagento.ПометкаУдаления
	               |	И БП_ГрафикРаботыМенеджеровMagento.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров_Хорошоп.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафикаХорошоп
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров_Хорошоп КАК ГрафикРаботыМенеджеров_Хорошоп
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров_Хорошоп.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров_Хорошоп.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	ПолучимКолВоПредЗаказов.КолВоПредзаказов КАК КолВоПредзаказов
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ГрафикРаботыМенеджеровМенеджера.Менеджер КАК Менеджер,
	               |		ГрафикРаботыМенеджеровМенеджера.Ссылка КАК Ссылка
	               |	ИЗ
	               |		Документ.ГрафикРаботыМенеджеров.Менеджера КАК ГрафикРаботыМенеджеровМенеджера,
	               |		ВТДокументГрафика КАК ВТДокументГрафика
	               |	ГДЕ
	               |		ВТДокументГрафика.Номер = ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка КАК Ссылка,
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Менеджер КАК Менеджер
	               |			ИЗ
	               |				ВТДокументГрафикаХорошоп КАК ВТГрафикХорошоп,
	               |				Документ.ГрафикРаботыМенеджеров_Хорошоп.Менеджера КАК ГрафикРаботыМенеджеров_ХорошопМенеджера
	               |			ГДЕ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка.Номер = ВТГрафикХорошоп.Номер) КАК ПолучимДокументГрафикаХорошоп
	               |			ПО (ПолучимДокументГрафикаХорошоп.Менеджер = Пользователи.Ссылка)
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Менеджер КАК Менеджер,
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento КАК ВТБП_ГрафикРаботыМенеджеровMagento,
	               |				Документ.БП_ГрафикРаботыМенеджеровMagento.Менеджера КАК БП_ГрафикРаботыМенеджеровMagentoМенеджера
	               |			ГДЕ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento.Номер = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафикаМадженто
	               |			ПО Пользователи.Ссылка = ПолучимДокументГрафикаМадженто.Менеджер
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПредЗаказ.Ссылка) КАК КолВоПредзаказов,
	               |				ПредЗаказ.Ответственный КАК Ответственный
	               |			ИЗ
	               |				Документ.ПредЗаказ КАК ПредЗаказ
	               |			ГДЕ
	               |				ПредЗаказ.Статус.Код = ""000000072""
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ПредЗаказ.Ответственный) КАК ПолучимКолВоПредЗаказов
	               |			ПО Пользователи.Ссылка = ПолучимКолВоПредЗаказов.Ответственный
	               |		ПО ПолучимДокументГрафика.Менеджер = Пользователи.Ссылка
	               |ГДЕ
	               |	(НЕ ПолучимДокументГрафикаХорошоп.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафика.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафикаМадженто.Ссылка ЕСТЬ NULL)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КолВоПредзаказов";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0];
	КонецЕсли;   	
	Возврат Неопределено;
	
КонецФункции 

функция ПолучитьПоследнегоОтветсвенногоКтоКонтактировал(Номер) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафика
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров КАК ГрафикРаботыМенеджеров
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(БП_ГрафикРаботыМенеджеровMagento.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТБП_ГрафикРаботыМенеджеровMagento
	               |ИЗ
	               |	Документ.БП_ГрафикРаботыМенеджеровMagento КАК БП_ГрафикРаботыМенеджеровMagento
	               |ГДЕ
	               |	НЕ БП_ГрафикРаботыМенеджеровMagento.ПометкаУдаления
	               |	И БП_ГрафикРаботыМенеджеровMagento.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров_Хорошоп.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафикаХорошоп
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров_Хорошоп КАК ГрафикРаботыМенеджеров_Хорошоп
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров_Хорошоп.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров_Хорошоп.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь
	               |ПОМЕСТИТЬ ВТОбщ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ГрафикРаботыМенеджеровМенеджера.Менеджер КАК Менеджер,
	               |		ГрафикРаботыМенеджеровМенеджера.Ссылка КАК Ссылка
	               |	ИЗ
	               |		Документ.ГрафикРаботыМенеджеров.Менеджера КАК ГрафикРаботыМенеджеровМенеджера,
	               |		ВТДокументГрафика КАК ВТДокументГрафика
	               |	ГДЕ
	               |		ВТДокументГрафика.Номер = ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка КАК Ссылка,
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Менеджер КАК Менеджер
	               |			ИЗ
	               |				ВТДокументГрафикаХорошоп КАК ВТГрафикХорошоп,
	               |				Документ.ГрафикРаботыМенеджеров_Хорошоп.Менеджера КАК ГрафикРаботыМенеджеров_ХорошопМенеджера
	               |			ГДЕ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка.Номер = ВТГрафикХорошоп.Номер) КАК ПолучимДокументГрафикаХорошоп
	               |			ПО (ПолучимДокументГрафикаХорошоп.Менеджер = Пользователи.Ссылка)
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Менеджер КАК Менеджер,
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento КАК ВТБП_ГрафикРаботыМенеджеровMagento,
	               |				Документ.БП_ГрафикРаботыМенеджеровMagento.Менеджера КАК БП_ГрафикРаботыМенеджеровMagentoМенеджера
	               |			ГДЕ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento.Номер = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафикаМадженто
	               |			ПО Пользователи.Ссылка = ПолучимДокументГрафикаМадженто.Менеджер
	               |		ПО ПолучимДокументГрафика.Менеджер = Пользователи.Ссылка
	               |ГДЕ
	               |	(НЕ ПолучимДокументГрафикаХорошоп.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафика.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафикаМадженто.Ссылка ЕСТЬ NULL)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Событие.Ответственный,
	               |	Событие.Ссылка
	               |ИЗ
	               |	Документ.Событие КАК Событие,
	               |	ВТОбщ КАК ВТОбщ
	               |ГДЕ
	               |	Событие.Э_ТелефонАбонента = &Э_ТелефонАбонента
	               |	И Событие.Ответственный В (ВТОбщ.Пользователь)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Событие.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Э_ТелефонАбонента",Номер);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ответственный");
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0];
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивАктивныхМенеджеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафика
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров КАК ГрафикРаботыМенеджеров
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(БП_ГрафикРаботыМенеджеровMagento.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТБП_ГрафикРаботыМенеджеровMagento
	               |ИЗ
	               |	Документ.БП_ГрафикРаботыМенеджеровMagento КАК БП_ГрафикРаботыМенеджеровMagento
	               |ГДЕ
	               |	НЕ БП_ГрафикРаботыМенеджеровMagento.ПометкаУдаления
	               |	И БП_ГрафикРаботыМенеджеровMagento.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров_Хорошоп.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафикаХорошоп
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров_Хорошоп КАК ГрафикРаботыМенеджеров_Хорошоп
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров_Хорошоп.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров_Хорошоп.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ГрафикРаботыМенеджеровМенеджера.Менеджер КАК Менеджер,
	               |		ГрафикРаботыМенеджеровМенеджера.Ссылка КАК Ссылка
	               |	ИЗ
	               |		Документ.ГрафикРаботыМенеджеров.Менеджера КАК ГрафикРаботыМенеджеровМенеджера,
	               |		ВТДокументГрафика КАК ВТДокументГрафика
	               |	ГДЕ
	               |		ВТДокументГрафика.Номер = ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка КАК Ссылка,
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Менеджер КАК Менеджер
	               |			ИЗ
	               |				ВТДокументГрафикаХорошоп КАК ВТГрафикХорошоп,
	               |				Документ.ГрафикРаботыМенеджеров_Хорошоп.Менеджера КАК ГрафикРаботыМенеджеров_ХорошопМенеджера
	               |			ГДЕ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка.Номер = ВТГрафикХорошоп.Номер) КАК ПолучимДокументГрафикаХорошоп
	               |			ПО (ПолучимДокументГрафикаХорошоп.Менеджер = Пользователи.Ссылка)
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Менеджер КАК Менеджер,
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento КАК ВТБП_ГрафикРаботыМенеджеровMagento,
	               |				Документ.БП_ГрафикРаботыМенеджеровMagento.Менеджера КАК БП_ГрафикРаботыМенеджеровMagentoМенеджера
	               |			ГДЕ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento.Номер = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафикаМадженто
	               |			ПО Пользователи.Ссылка = ПолучимДокументГрафикаМадженто.Менеджер
	               |		ПО ПолучимДокументГрафика.Менеджер = Пользователи.Ссылка
	               |ГДЕ
	               |	(НЕ ПолучимДокументГрафикаХорошоп.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафика.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафикаМадженто.Ссылка ЕСТЬ NULL)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

функция ПолучитьМассивМенеджеров() Экспорт  
	
Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка как Пользователь
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Родитель.Наименование = ""Менеджера""";
	
	
Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");

КонецФункции
  
Функция ПолучитьMagentoТекущийМенеджер(ТипЦены,MagentoТекущийМенеджер) Экспорт
		
	ТекНомМенеджер = MagentoТекущийМенеджер.Получить();	
	Мен = ТекНомМенеджер+1;
	MagentoТекущийМенеджер.Установить(Мен);

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.НомерСтроки,
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.Менеджер,
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Ссылка,
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер,
	               |	ПолучимДокумент.Номер КАК Номер1
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(БП_ГрафикРаботыМенеджеровMagento.Дата) КАК Дата,
	               |		БП_ГрафикРаботыМенеджеровMagento.Номер КАК Номер
	               |	ИЗ
	               |		Документ.БП_ГрафикРаботыМенеджеровMagento КАК БП_ГрафикРаботыМенеджеровMagento
	               |	ГДЕ
	               |		БП_ГрафикРаботыМенеджеровMagento.ТипЦены = &ТипЦены
	               |		И БП_ГрафикРаботыМенеджеровMagento.Проведен
	               |		И БП_ГрафикРаботыМенеджеровMagento.Дата <= &Дата
	               |		И БП_ГрафикРаботыМенеджеровMagento.ДатаПо >= &Дата
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		БП_ГрафикРаботыМенеджеровMagento.Номер) КАК ПолучимДокумент
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БП_ГрафикРаботыМенеджеровMagento.Менеджера КАК БП_ГрафикРаботыМенеджеровMagentoМенеджера
	               |		ПО ПолучимДокумент.Дата = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Дата
	               |			И ПолучимДокумент.Номер = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.НомерСтроки";
	
	
	Запрос.УстановитьПараметр("ТипЦены",ТипЦены);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Менеджеры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Менеджер");	
			
	Кво = Менеджеры.Количество();
    Если Кво = 0 Тогда
        Сообщить("Нет менеджеров для типа цены!");
        Возврат Справочники.Пользователи.ПустаяСсылка();
    КонецЕсли;

    Поз = Мен-Цел(Мен/Кво)*Кво;
    Если Поз = 0 Тогда
        Поз = Кво;
    КонецЕсли;

    Возврат Менеджеры[Поз - 1]; // 0-based индекс

КонецФункции  

Функция ПолучитьТекущегоМенеджера() Экспорт
		
	ТекНомМенеджер = константы.ТекущийМенелдер.Получить();
	Константы.ТекущийМенелдер.Установить(ТекНомМенеджер+1);
	Мен = Константы.ТекущийМенелдер.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГрафикРаботыМенеджеровМенеджера.НомерСтроки,
	               |	ГрафикРаботыМенеджеровМенеджера.Менеджер,
	               |	ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МИНИМУМ(ГрафикРаботыМенеджеров.Номер) КАК Номер
	               |	ИЗ
	               |		Документ.ГрафикРаботыМенеджеров КАК ГрафикРаботыМенеджеров
	               |	ГДЕ
	               |		ГрафикРаботыМенеджеров.Проведен
	               |		И ГрафикРаботыМенеджеров.Дата >= &Дата
	               |		И ГрафикРаботыМенеджеров.ДатаПо <= &Дата) КАК ПолучимДокумент
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГрафикРаботыМенеджеров.Менеджера КАК ГрафикРаботыМенеджеровМенеджера
	               |		ПО ПолучимДокумент.Номер = ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГрафикРаботыМенеджеровМенеджера.НомерСтроки";
	
	
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Менеджеры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Менеджер");		
		
	Кво = Менеджеры.Количество();
    Если Кво = 0 Тогда
        Сообщить("Нет менеджеров для типа цены!");
        Возврат Справочники.Пользователи.ПустаяСсылка();
    КонецЕсли;

    Поз = Мен-Цел(Мен/Кво)*Кво;
    Если Поз = 0 Тогда
        Поз = Кво;
    КонецЕсли;

    Возврат Менеджеры[Поз - 1]; // 0-based индекс

КонецФункции
